<?php
//задание 1
$a=0;
while($a++ <= 100) if($a%3==0) 
echo $a .'<br />'; 


//задание 2
$a=0;

do 

if($a%2==0 and $a>0)  {
echo "$a-это четное".'<br />';}
 
elseif ($a%2!==0)  {
echo "$a-это нечетное".'<br />';
} 
elseif ($a==0)
{
	echo "0 - это ноль".'<br />';
}


 while($a++<=9); 



// задание 3

 $oblast = ["Московская область" => ["Москва", "Зеленоград", "Клин"],

 "Ленинградская область" => ["Санкт-Петербург", "Кронштадт", "Всеволожск"],

 "Архангельская область" => ["Архангельск", "Северодвинск", "Новодвинск"],
]; 


	foreach ($oblast as $obl => $city) {      
    echo $obl . ": <br>";                   
    foreach ($city as $cityName) {          
        echo $cityName . "<br>"; 
    }
}

// задание 4

function transliteration($sentence) {

$rus = ['a', 'б','в','г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']; 

$lat = ['a','b','v', 'g', 'd', 'e', 'e', 'zh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh', 'sch', 'y', 'y', 'y', 'e', 'yu', 'ya'];

return str_replace($rus,$lat, $sentence);
}

echo transliteration('привет!'); 

//задание 5


function whitespace ($seq) {


return strtr($seq, " ", "_");
}

echo whitespace('Учись хорошо'); 

//задание 7

for ($a = 1, $b = 0; $a<=10; $b +=$a, print $a, $a++);

// Задание 8 

	$oblast = ["Московская область" => ["Москва", "Зеленоград", "Клин"],

 "Ленинградская область" => ["Санкт-Петербург", "Кронштадт", "Всеволожск"],

 "Архангельская область" => ["Архангельск", "Северодвинск", "Новодвинск"],
]; 


	foreach ($oblast as $obl => $city) {      
    echo $obl . ": <br>";                   
    
    foreach ($city as $cityName) 
       if (mb_substr($cityName, 0, 1) === "К")
{
        echo $cityName . "<br>"; }
    
}


